In [2]:
import pandas as pd

In [3]:
df =pd.read_csv("sales1_data.csv")

In [4]:
df.head()

         Date   Product  Sales Region
0  2023-01-01  Product3  738.0   West
1  2023-01-02  Product2  868.0  North
2  2023-01-03  Product2  554.0   West
3  2023-01-04  Product1  618.0  South
4  2023-01-05  Product3  501.0   East

In [5]:
df.isnull().sum()

Date       0
Product    0
Sales      6
Region     0
dtype: int64

In [6]:
df["Sales"]=df["Sales"].fillna(df["Sales"].mean())

In [7]:
grouped_mean =df.groupby("Product")["Sales"].agg(["mean","sum",'count'])
grouped_mean

                mean     sum  count
Product
Product1  481.166667  2887.0      6
Product2  661.625000  5293.0      8
Product3  515.454545  5670.0     11

In [8]:
df.head()

         Date   Product  Sales Region
0  2023-01-01  Product3  738.0   West
1  2023-01-02  Product2  868.0  North
2  2023-01-03  Product2  554.0   West
3  2023-01-04  Product1  618.0  South
4  2023-01-05  Product3  501.0   East

In [9]:
df["Sales"] =df["Sales"].astype(int)

In [10]:
df = df.rename(columns={"Date":"Sale Date"})

In [11]:
df.head(2)

    Sale Date   Product  Sales Region
0  2023-01-01  Product3    738   West
1  2023-01-02  Product2    868  North

In [12]:
df["New Sales"] = df["Sales"].apply(lambda x : x**2)

In [13]:
df.head()

    Sale Date   Product  Sales Region  New Sales
0  2023-01-01  Product3    738   West     544644
1  2023-01-02  Product2    868  North     753424
2  2023-01-03  Product2    554   West     306916
3  2023-01-04  Product1    618  South     381924
4  2023-01-05  Product3    501   East     251001

In [14]:
grouped_mean =df.groupby(["Product","Region"])["Sales"].agg(["mean","sum","count"])
grouped_mean

                   mean   sum  count
Product  Region
Product1 South   466.60  2333      5
         West    554.00   554      1
Product2 North   658.00  2632      4
         South   816.00   816      1
         West    615.00  1845      3
Product3 East    563.20  2816      5
         South   309.50   619      2
         West    558.75  2235      4

In [16]:
df.head()

    Sale Date   Product  Sales Region  New Sales
0  2023-01-01  Product3    738   West     544644
1  2023-01-02  Product2    868  North     753424
2  2023-01-03  Product2    554   West     306916
3  2023-01-04  Product1    618  South     381924
4  2023-01-05  Product3    501   East     251001

In [18]:
groupedc=df.groupby(["Region"])["Product"].count()
groupedc

Region
East     5
North    4
South    8
West     8
Name: Product, dtype: int64